# Renaming Columns in Pandas

In [1]:
#load Pandas
import pandas as pd

In [2]:
#Create Sample DataFrame with Columnns we want to Rename
df1 = pd.DataFrame({'$Customer': ['Raj', 'Rahul', 'Ankit', 'Priyanka']
                    , '$Sales': [3453,5674, 9374,4282]
                    , 'Qutity' : [3, 5, 9, 4]})

#Create DataFrame for example 2 
df2 = pd.DataFrame({'Customer': ['Raj', 'Rahul', 'Ankit', 'Priyanka']
                    , 'Sales': [3453,5674, 9374,4282]
                    , '##Qutity' : [3, 5, 9, 4]})

## Trick 1: Changing all Columns

In [3]:
df1

  $Customer  $Sales  Qutity
0       Raj    3453       3
1     Rahul    5674       5
2     Ankit    9374       9
3  Priyanka    4282       4

In [4]:
#Use ".columns" property of DataFrame
df1.columns = ['Customer', 'Sales', 'Quantity']
df1

   Customer  Sales  Quantity
0       Raj   3453         3
1     Rahul   5674         5
2     Ankit   9374         9
3  Priyanka   4282         4

## Trick 2: Changing Specific Columns

In [5]:
df2

   Customer  Sales  ##Qutity
0       Raj   3453         3
1     Rahul   5674         5
2     Ankit   9374         9
3  Priyanka   4282         4

In [7]:
df2.rename(columns={'##Qutity' : 'Quantity'})
df2

   Customer  Sales  ##Qutity
0       Raj   3453         3
1     Rahul   5674         5
2     Ankit   9374         9
3  Priyanka   4282         4

## Trick 2.1: Changing Specific Columns using "inplace" argument

In [8]:
df2.rename(columns={'##Qutity' : 'Quantity'}, inplace = True)
df2

   Customer  Sales  Quantity
0       Raj   3453         3
1     Rahul   5674         5
2     Ankit   9374         9
3  Priyanka   4282         4